<template>
  <div id="scroll-board">
    <dv-scroll-board :config="config" />
  </div>
</template>

<script>
export default {
  name: 'ScrollBoard',
  data () {
    return {
      config: {
        header: ['时间', '订单号',"款式",'数量','成交金额'],
        data: [
          ['2022-06-15 19:25:00', '1655379038893291102153', '修身正常袖卫衣', '2',"9265$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
          ['2022-06-16 17:25:00', '1655385595780301101151', '超宽松版卫衣', '3',"7435$"],
        ],
        index: true,
        columnWidth: [50, 150, 200,130,60],
        align: ['center'],
        rowNum: 7,
        headerBGC: '#1981f6',
        headerHeight: 45,
        oddRowBGC: 'rgba(0, 44, 81, 0.8)',
        evenRowBGC: 'rgba(10, 29, 50, 0.8)'
      }
    }
  }
}
</script>

<style lang="less">
#scroll-board {
  width: 50%;
  box-sizing: border-box;
  margin-left: 20px;
  height: 100%;
  overflow: hidden;
}
</style>
